// Copyright (c) 2026 Nicolai Grodzitski
// SPDX-License-Identifier: BSL-1.0

/**
 * @file Price level routines using segregated SOA approach.
 */

#pragma once

#include <bit>
#include <cstring>
#include <iterator>
#include <memory>
#include <memory_resource>
#include <optional>
#include <stdexcept>

#include <range/v3/view/generate.hpp>
#include <range/v3/view/take_while.hpp>
#include <range/v3/view/transform.hpp>

#include <jacobi/book/soa_price_level.hpp>

namespace jacobi::book
{

namespace details
{

using unified_soa_position_t = soa_price_level_order_node_pos_t< std::uint32_t >;

//
// soa_buf_read_u32()
//

/**
 * @brief Read u32 from raw bytes.
 *
 * @pre Address `d` must be properly aligned (4).
 */
[[nodiscard]] inline std::uint32_t soa_buf_read_u32( const std::byte * d ) noexcept
{
    std::uint32_t value;
    std::memcpy( &value, d, sizeof( value ) );
    return value;
}

//
// soa_buf_write_u32()
//

/**
 * @brief Writes u32 to raw bytes.
 *
 * @pre Address `d` must be properly aligned (4).
 */
inline void soa_buf_write_u32( std::uint32_t value, std::byte * d ) noexcept
{
    std::memcpy( d, &value, sizeof( value ) );
}

//
// soa_buf_capacity_offset
//

/**
 * @brief The location of the capacity parameter in a price level soa data buffer.
 */
constexpr std::size_t soa_buf_capacity_offset = sizeof( std::uint32_t );

//
// soa_buf_alignment
//

constexpr std::size_t soa_buf_alignment = 8;

using raw_buffer_t = std::span< std::byte >;

//
// Soa_Index_Type
//

template < typename T >
concept Soa_Index_Type =
    std::same_as< T, std::uint8_t > || std::same_as< T, std::uint16_t >
    || std::same_as< T, std::uint32_t >;

//
// extra_links_for_anchors
//

constexpr std::uint8_t extra_links_for_anchors = 2;

//
// soa_price_level_data_t
//

/**
 * @brief Price level orders data buffer accessor object.
 *
 * Operates over a raw buffer. For performance it expects a proper alignments.
 * It is a part of an internal implementation and is not meant for using
 * otherwise.
 *
 * The attached buffer must have the following data layout:
 * @code
 * [3:0] Size
 * [7:4] Capacity (CAP)
 * [I-1:8] Order ids;                  I = 8 + CAP*8
 * [Q-1:I] Order qtys;                 Q = I + CAP*4
 * [L-1:Q] Node links;                 L = Q + (CAP+2) * sizeof(Index_Type)
 * @endcode
 *
 * Lifetime concerns are addressed by C++20's P0593 rules.
 * We have only trivial types in buffer.
 */
template < Soa_Index_Type Index_Type >
class soa_price_level_data_access_t
{
    using short_index_t = Index_Type;
    constexpr inline static short_index_t links_head_pos{ 0 };
    constexpr inline static short_index_t links_free_head_pos{ 1 };

    using raw_order_id_t  = order_id_t::value_type;
    using raw_order_qty_t = order_qty_t::value_type;

    //
    // raw_soa_links_t
    //

    /**
     * @brief Short SOA data referencing to adjacent nodes.
     *
     */
    struct raw_soa_links_t
    {
        short_index_t prev;
        short_index_t next;
    };

    /**
     * @name Offset calculations data in the buffer.
     */
    /// @{
    [[nodiscard]] constexpr static std::size_t ids_offset() noexcept { return 8; }

    [[nodiscard]] constexpr static std::size_t qtys_offset(
        std::size_t cap ) noexcept
    {
        return ids_offset() + cap * sizeof( raw_order_id_t );
    }

    [[nodiscard]] constexpr static std::size_t links_offset(
        std::size_t cap ) noexcept
    {
        return qtys_offset( cap ) + cap * sizeof( raw_order_qty_t );
    }

    // ==================================================================
    // We expect a certain alignment for the data:
    static_assert( ids_offset() % alignof( raw_order_id_t ) == 0 );

    static_assert( qtys_offset( 1 ) % alignof( raw_order_qty_t ) == 0 );
    static_assert( qtys_offset( 2 ) % alignof( raw_order_qty_t ) == 0 );
    static_assert( qtys_offset( 3 ) % alignof( raw_order_qty_t ) == 0 );
    static_assert( qtys_offset( 4 ) % alignof( raw_order_qty_t ) == 0 );

    static_assert( links_offset( 1 ) % alignof( raw_soa_links_t ) == 0 );
    static_assert( links_offset( 2 ) % alignof( raw_soa_links_t ) == 0 );
    static_assert( links_offset( 3 ) % alignof( raw_soa_links_t ) == 0 );
    static_assert( links_offset( 4 ) % alignof( raw_soa_links_t ) == 0 );
    // ==================================================================
    /// @}

public:
    constexpr inline static std::size_t max_capacity =
        std::numeric_limits< short_index_t >::max() - 1;

    [[nodiscard]] constexpr static std::size_t required_size(
        std::uint32_t cap ) noexcept
    {
        return links_offset( cap )
               + ( cap + extra_links_for_anchors ) * sizeof( raw_soa_links_t );
    }

    static std::uint32_t validate_buffer(
        std::span< const std::byte > buf,
        std::optional< short_index_t > expected_capacity = std::nullopt )
    {
        if( 0
            != reinterpret_cast< std::uintptr_t >( buf.data() )
                   % soa_buf_alignment )
        {
            throw std::runtime_error{ "buffer misaligned" };
        }

        if( buf.size() < 2 * sizeof( std::uint32_t ) )
        {
